# Python DataFrames - Pandas

The Pandas library is built on top of NumPy and introduces the DataFrame as its core data structure. Think of a DataFrame as a table where each column can hold data of different types, such as numbers, text, or even dates. This flexibility makes it ideal for working with real-world datasets, where information is rarely uniform.

A key feature of Pandas is how easily you can manipulate this data. For example, you can set any column as an index or extract specific rows or columns to work with smaller sections of your data. This allows for efficient and intuitive data handling, even when working with large or complex datasets.

Additionally, Pandas integrates tightly with NumPy. Behind the scenes, a DataFrame is built on top of NumPy’s ndarray, meaning you can tap into NumPy’s powerful array-based calculations directly from your Pandas objects. This connection allows you to blend the high-level data manipulation features of Pandas with the computational efficiency of NumPy.

In short, Pandas not only helps you organize and manipulate data easily but also lets you leverage NumPy’s speed and functionality when you need it.

In [10]:
# Import the Pandas library
import pandas as pd
# We will also need NumPy
import numpy as np

## The **1D-Series**

It’s quite similar to a one-dimensional NumPy array (ndarray), but with a key difference: a Series comes with flexible, labeled indexing for its entries.

In a Series, each data element is associated with an index, which doesn’t have to be limited to integers as in NumPy arrays — it can be anything from strings to dates. This allows for more intuitive and meaningful data manipulation, especially when working with real-world datasets where labels are often more informative than numerical positions.

In essence, a Series combines the efficiency of a NumPy array with the added power of custom labeling, offering a versatile tool for handling one-dimensional data.

### Construction of a **1D-Series**

A Series can be created from a list:

In [11]:
a = pd.Series([0.3,11.1,4.3,43.2,0.5,20.2])
print(a)

0     0.3
1    11.1
2     4.3
3    43.2
4     0.5
5    20.2
dtype: float64

From this Seriues we can directly access the underlying NumPy ndarray:

In [12]:
v = a.values
print(v)
print(type(v))

[ 0.3 11.1  4.3 43.2  0.5 20.2]
<class 'numpy.ndarray'>

It is also possible to change data via the values:

In [13]:
a.values[0] = 100
print(a)

0    100.0
1     11.1
2      4.3
3     43.2
4      0.5
5     20.2
dtype: float64

However, this can also be done directly via the index:

In [14]:
a[0] = 200
print(a)

0    200.0
1     11.1
2      4.3
3     43.2
4      0.5
5     20.2
dtype: float64

In [15]:
# The index is its own data object:
print(a.index)

RangeIndex(start=0, stop=6, step=1)

We can create data with specified index values:

In [16]:
a = pd.Series([0.3,11.1,4.3,43.2,0.5,20.2],
    index = [4,5,10,11,12,16])
print(a)
print(a.index)

4      0.3
5     11.1
10     4.3
11    43.2
12     0.5
16    20.2
dtype: float64
Index([4, 5, 10, 11, 12, 16], dtype='int64')

Now the index position 0 does not exist anymore

In [17]:
print(a[2])

KeyError: 2

But the data can be still accessed and changed via the (correct) index:

In [18]:
print(a[4])
a[4] = 500
print(a)

0.3
4     500.0
5      11.1
10      4.3
11     43.2
12      0.5
16     20.2
dtype: float64

<div style="padding: 10px; border-left: 6px solid #2196F3; border-radius: 4px;">
  <strong>Note:</strong> If you assign data to unknown indices, this <b>will be added</b>.
</div>

In [19]:
a[0] = 0
print(a)

4     500.0
5      11.1
10      4.3
11     43.2
12      0.5
16     20.2
0       0.0
dtype: float64

The indices do not have to be strictly numbers; they can also be strings or other data types.

In [20]:
# Using strings as indices:
a["Spam"] = -4
a["my lucky number"] = 30
print(a)

4                  500.0
5                   11.1
10                   4.3
11                  43.2
12                   0.5
16                  20.2
0                    0.0
Spam                -4.0
my lucky number     30.0
dtype: float64

In this case the index has the most general data type **object**:

In [21]:
# Show the data type of the index 
print(a.index)

Index([4, 5, 10, 11, 12, 16, 0, 'Spam', 'my lucky number'], dtype='object')

We can name the index and the data columns

In [22]:
a.name = "data"
a.index.name = "myindex"
print(a)

myindex
4                  500.0
5                   11.1
10                   4.3
11                  43.2
12                   0.5
16                  20.2
0                    0.0
Spam                -4.0
my lucky number     30.0
Name: data, dtype: float64

#### Slicing in **1-D Series**

To demonstrate the slicing for Series, we will create a slightly more complex object based on a dictionary for the object creation:

In [23]:
# We can also use dictionaries for the object creation:
indict = {
    'California': 38332521,
    'Texas': 26448193,
    'New York': 19651127,
    'Florida': 19552860,
    'Illinois': 12882135
}
a = pd.Series(indict)
print(a)

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

Now that we created the Pandas Series `a` from the dictionary we can perform the slicing (which is not supported by dictionaries).

In [24]:
# Slicing from the index
print(a["Texas":"Florida"])

Texas       26448193
New York    19651127
Florida     19552860
dtype: int64

<div style="padding: 10px; border-left: 6px solid #2196F3; border-radius: 4px;">
  <strong>Note:</strong> Pandas <b>includes</b> the end of the range, in contrast to NumPy slicing, which does not include the end of the range data.
</div>

In [25]:
# NumPy slicing
print(a.values[1:3])

[26448193 19651127]

Basic collective data is available via functions:

In [26]:
# Basic data statistic's function
#print(a.mean())
#print(a.std())
#print(a.min())
#print(a.max())
#print(a.sum())

# Simply provides all the functions above in a single command
print(a.describe())

count    5.000000e+00
mean     2.337337e+07
std      9.640386e+06
min      1.288214e+07
25%      1.955286e+07
50%      1.965113e+07
75%      2.644819e+07
max      3.833252e+07
dtype: float64

### The multi-dimensional **DataFrame**

The Pandas **DataFrame** can be understood as a sequence of aligned _Series_ objects, with a common flexible index and column names. It is Pandas central data structure, and extremely powerfull for any kind of tablular data.

*DataFrame* objects have a number of columns with data, and an index. The latter can be thought of as the quantity that defines rows in the table. Pandas then makes it very easy and fast to operate on subsets of columns or rows or both, much faster than any loop could do.

Furthermore, by using so-called *multi indices* or *groups* we can in some sense also organize data with more than two dimensions, as we shall see in later in this lecture.

### Construction a **DataFrame**

Pandas _DataFrame_ objects can be created from a:
- Single series object
- List of dictionaries
- Dictionary of lists
- Dictionary of series objects
- Two-dimensional NumPy ndarray
- Index list/ndarray and empty columns

In [27]:
# Example for the construction from a series object
a = pd.DataFrame(a)
print(a)

                   0
California  38332521
Texas       26448193
New York    19651127
Florida     19552860
Illinois    12882135

In [28]:
# Example for the construction from a dict of lists:
a = pd.DataFrame(
    {"Name": ["Max","Doro","Carl"], 
     "Points":[46,49,34],
     "StudentID":[12345,12346,12350]}
)

print("Original Data")
print(a)
print()

# we can selects one of the columns as index:
a.set_index("Name", inplace=True)
print("Rearranged Data")
print(a)

Original Data
   Name  Points  StudentID
0   Max      46      12345
1  Doro      49      12346
2  Carl      34      12350

Rearranged Data
      Points  StudentID
Name
Max       46      12345
Doro      49      12346
Carl      34      12350

In [29]:
# Example for the construction from a list of dicts:
data = [{'a': i, 'b': 2 * i} for i in range(3)]
print("data =",data)
print()

# Note that no index was specified, so Pandas adds a counting index:
a = pd.DataFrame(data)
print(a)

data = [{'a': 0, 'b': 0}, {'a': 1, 'b': 2}, {'a': 2, 'b': 4}]

   a  b
0  0  0
1  1  2
2  2  4

In [30]:
# Example for the creation from ndarray:
data = np.arange(0,30).reshape(5,6)
print(data)
print()

a = pd.DataFrame(data=data, columns=["A","B","C","D","E","F"]) #,index=[1,5,2,6,1])
print(a)

[[ 0  1  2  3  4  5]
 [ 6  7  8  9 10 11]
 [12 13 14 15 16 17]
 [18 19 20 21 22 23]
 [24 25 26 27 28 29]]

    A   B   C   D   E   F
0   0   1   2   3   4   5
1   6   7   8   9  10  11
2  12  13  14  15  16  17
3  18  19  20  21  22  23
4  24  25  26  27  28  29

In [31]:
# Example for the creation from an index with empty columns:
times = np.arange('2020-01-01', '2020-01-06', dtype='datetime64[D]')
print(times)
print()

a = pd.DataFrame(index=times, columns=["A","B","C"])
a.index.name = "Date"
print(a)

['2020-01-01' '2020-01-02' '2020-01-03' '2020-01-04' '2020-01-05']

              A    B    C
Date
2020-01-01  NaN  NaN  NaN
2020-01-02  NaN  NaN  NaN
2020-01-03  NaN  NaN  NaN
2020-01-04  NaN  NaN  NaN
2020-01-05  NaN  NaN  NaN

<div style="padding: 10px; border-left: 6px solid #2196F3; border-radius: 4px;">
  <strong>Note:</strong> Pandas fills missing data with <b>NaN</b>. This is the general behaviour, and it is easy to fill the data after creation. However, make sure that the data types of the columns match your data, and reset it otherwise.
</div>

In [32]:
print(a.dtypes)

A    object
B    object
C    object
dtype: object

In [33]:
# Reset data type of a column:
a["A"] = a["A"].astype(np.float64)
print(a)
print()

print(a.dtypes)

             A    B    C
Date
2020-01-01 NaN  NaN  NaN
2020-01-02 NaN  NaN  NaN
2020-01-03 NaN  NaN  NaN
2020-01-04 NaN  NaN  NaN
2020-01-05 NaN  NaN  NaN

A    float64
B     object
C     object
dtype: object

We can also create the DataFrame with a specific dtype:

In [34]:
a = pd.DataFrame(index=times, columns=["A","B","C","D"], dtype=np.float64)
a.index.name = "Date"
print(a)
print()
print(a.dtypes)

             A   B   C   D
Date
2020-01-01 NaN NaN NaN NaN
2020-01-02 NaN NaN NaN NaN
2020-01-03 NaN NaN NaN NaN
2020-01-04 NaN NaN NaN NaN
2020-01-05 NaN NaN NaN NaN

A    float64
B    float64
C    float64
D    float64
dtype: object

It is possible to start from a DataFrame with only an index:

In [35]:
a = pd.DataFrame(index=times)
a.index.name = "Date"
print(a)
print()

# Now we can add the columns one-by-one:
a["A"] = 0.0

a["B"] = 0
a["C"] = np.full(len(times), 3.13, dtype=np.float32)
a["C"] = [1,5,1,5,7]
# print(a)
# print()

# print(a.dtypes)
print(a)

Empty DataFrame
Columns: []
Index: [2020-01-01 00:00:00, 2020-01-02 00:00:00, 2020-01-03 00:00:00, 2020-01-04 00:00:00, 2020-01-05 00:00:00]

              A  B  C
Date
2020-01-01  0.0  0  1
2020-01-02  0.0  0  5
2020-01-03  0.0  0  1
2020-01-04  0.0  0  5
2020-01-05  0.0  0  7

In [36]:
# Get index object:
print(a.index)

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05'],
              dtype='datetime64[s]', name='Date', freq=None)

In [37]:
# get columns:
print(a.columns)

Index(['A', 'B', 'C'], dtype='object')

#### Indexing and slicing

In Pandas, using the square bracket `[ ]` operator for indexing doesn't always behave the same way as in NumPy, and this can lead to confusion when modifying data.

- **Indexing in NumPy vs. Pandas:**
    - In NumPy, slicing with `[ ]` typically gives you a view, meaning any changes made to the slice will affect the original array. However, fancy indexing (using lists or arrays of indices) in NumPy returns a copy, and modifications won't affect the original data.
    - In Pandas, the `[ ]` operator often returns an intermediate object, which is typically a copy rather than a view. This means changes made to the data won’t necessarily affect the original DataFrame or Series. If you try to modify this copy, Pandas may raise a _SettingWithCopyWarning_, indicating that your change might not apply to the original data.

- **Avoiding the Confusion:** To avoid the confusion between views and copies, Pandas provides specific methods for safe slicing and indexing:
    - **`loc`:** For label-based indexing (accessing data by row and column labels).
    - **`iloc`:** For position-based indexing (accessing data by row and column positions).
    - **`at`:** For fast access to single elements by label.
    - **`iat`:** For fast access to single elements by position.

These methods always return a view of the data, ensuring that any modifications are directly applied to the original DataFrame or Series. This eliminates the risk of inadvertently modifying a copy.

<div style="padding: 10px; border-left: 6px solid #FFA756; border-radius: 4px;">
  <strong>When to Use the square operator:</strong> The square bracket operator is fine for reading data or performing calculations where you <b> don’t need to modify the original data</b>. However, to safely change or update data, it’s best to use loc, iloc, at, or iat
</div>

You can see the differences in the example below:

In [38]:
# Create a DataFrame object:
a = pd.DataFrame(
    {"Name": ["Max","Doro","Carl"], "Points":[46,49,34],"StudentID":[12345,12346,12350]})
a.set_index("Name", inplace=True)
print(a)

      Points  StudentID
Name
Max       46      12345
Doro      49      12346
Carl      34      12350

In [39]:
# We can also always access the underlying 2D numpy array:
print(a.values)

[[   46 12345]
 [   49 12346]
 [   34 12350]]

In [40]:
# Now, let's try indexing. For NumPy the []-operator with one argument selects a row:
print(a.values[0])

[   46 12345]

In [41]:
# For Pandas, the []-operator with one argument selects a column, i.e., a Series object of sub-data:
print(a["Points"])

Name
Max     46
Doro    49
Carl    34
Name: Points, dtype: int64

You can alternatively also use the dot operator `.` instead of the square bracket (but be sure that your column name does not coincide with a DataFrame attribute or function name):

In [42]:
print(a.Points)

Name
Max     46
Doro    49
Carl    34
Name: Points, dtype: int64

You can run collective calculations on any DataFrame, be it the full or a selection:

In [43]:
print("The DataFrame")
print(a)
print() 

# Calculate mean of all the columns
print("The Mean of All Columns")
print(a.mean())
print()

# Calculate max number Points through the dot operator
print("The Max Points")
print(a.Points.max())
print()

# Calculate mean of the Points column through the square operator
print("The Mean of Points")
print(a[["Points"]].mean())

The DataFrame
      Points  StudentID
Name
Max       46      12345
Doro      49      12346
Carl      34      12350

The Mean of All Columns
Points          43.0
StudentID    12347.0
dtype: float64

The Max Points
49

The Mean of Points
Points    43.0
dtype: float64

New columns can be assigned directly, as for NumPy fancy indexing. This helps with avoiding the creation of an intermediate objects:

In [44]:
# Directly assign a new column called Percent
a["Percent"] = a["Points"] / 50. * 100.
print(a)

      Points  StudentID  Percent
Name
Max       46      12345     92.0
Doro      49      12346     98.0
Carl      34      12350     68.0

Data from more than one column can be called within one command:

In [45]:
print(a[["Points","StudentID"]])

      Points  StudentID
Name
Max       46      12345
Doro      49      12346
Carl      34      12350

We can select rows by condition, similar to what we know from NumPy:

In [46]:
# Show when a condition is fulfilled
print(a["Percent"] > 90.0)

# Show the rows where the condition is fulfilled
print(a[ a["Percent"] > 90.0 ])

Name
Max      True
Doro     True
Carl    False
Name: Percent, dtype: bool
      Points  StudentID  Percent
Name
Max       46      12345     92.0
Doro      49      12346     98.0

**Chained indexing** is another method of selecting specific rows:

In [47]:
# Show the Points of the rows with the index "Max" and "Carl"
print(a["Points"][["Max","Carl"]])

Name
Max     46
Carl    34
Name: Points, dtype: int64

<div style="padding: 10px; border-left: 6px solid #2196F3; border-radius: 4px;">
  <strong>Note:</strong> Be careful with the above! Often one of the slicing functions is more efficient, even if you do not want to change data. The reason is that (e.g. <i>loc</i>) allows for indexing rows and columns within one and the same command (not chained as above). 
</div>

In [48]:
# Get a view of the whole data:
v = a.loc[:]
print(v)

      Points  StudentID  Percent
Name
Max       46      12345     92.0
Doro      49      12346     98.0
Carl      34      12350     68.0

In [49]:
# Get a view of a row:
print(a.loc["Doro"])

Points          49.0
StudentID    12346.0
Percent         98.0
Name: Doro, dtype: float64

In [50]:
# Change data in a row:
print("Original Data")
print(a)
print()

# Change the StudentID of the row with the index "Doro"
a.loc["Doro", "StudentID"] = 12355
print("Changed Data")
print(a)

Original Data
      Points  StudentID  Percent
Name
Max       46      12345     92.0
Doro      49      12346     98.0
Carl      34      12350     68.0

Changed Data
      Points  StudentID  Percent
Name
Max       46      12345     92.0
Doro      49      12355     98.0
Carl      34      12350     68.0

We can also select more than one row and change data:

In [51]:
print("Original Data")
print(a)
print()

# Change the Points and Percentages of the rows with the index "Doro" and "Max"
a.loc[["Max", "Doro"], "Points"] = [45, 48]
a.loc[["Max", "Doro"], "Percent"] = a.loc[["Max", "Doro"], "Points"] / 50. * 100.

print("Changed Data")
print(a)

Original Data
      Points  StudentID  Percent
Name
Max       46      12345     92.0
Doro      49      12355     98.0
Carl      34      12350     68.0

Changed Data
      Points  StudentID  Percent
Name
Max       45      12345     90.0
Doro      48      12355     96.0
Carl      34      12350     68.0

Likewise, we can change more than one column for the selected rows:

In [52]:
print("Original Data")
print(a)
print()

# Change the Points and Percentages in one like for the row with the index "Carl"
a.loc["Carl", ["Points", "Percent"]] = [40, 40. / 50. * 100]

print("Changed Data")
print(a)

Original Data
      Points  StudentID  Percent
Name
Max       45      12345     90.0
Doro      48      12355     96.0
Carl      34      12350     68.0

Changed Data
      Points  StudentID  Percent
Name
Max       45      12345     90.0
Doro      48      12355     96.0
Carl      40      12350     80.0

Similar operations can be done with `iloc`, but now the indices are counting integers for both rows and columns:

In [53]:
print("Original Data")
print(a)
print()

# Change the data in the row 1 and column 1
a.iloc[1, 1] = 12360

print("Changed Data")
print(a)

Original Data
      Points  StudentID  Percent
Name
Max       45      12345     90.0
Doro      48      12355     96.0
Carl      40      12350     80.0

Changed Data
      Points  StudentID  Percent
Name
Max       45      12345     90.0
Doro      48      12360     96.0
Carl      40      12350     80.0

For single value manipulation, `at` is slightly faster than `loc` (`iat` as above, based on integer indices instead of index and column names):

In [54]:
print("Original Data")
print(a)
print()

a.at["Carl", "StudentID"] = 12349

print("Changed Data")
print(a)

Original Data
      Points  StudentID  Percent
Name
Max       45      12345     90.0
Doro      48      12360     96.0
Carl      40      12350     80.0

Changed Data
      Points  StudentID  Percent
Name
Max       45      12345     90.0
Doro      48      12360     96.0
Carl      40      12349     80.0

As for the square operator, we can also select data based on conditions:

In [55]:
print("Original Data")
print(a)
print()

# If number of Points is smaller than 47, add 2 points
a.loc[ a["Points"] < 47, "Points"] += 2

print("Changed Data")
print(a)

Original Data
      Points  StudentID  Percent
Name
Max       45      12345     90.0
Doro      48      12360     96.0
Carl      40      12349     80.0

Changed Data
      Points  StudentID  Percent
Name
Max       47      12345     90.0
Doro      48      12360     96.0
Carl      42      12349     80.0

Below you can find an example for manipulating data with the `[]` operator, which is not a recommended method as mentioned above.

In [56]:
print("Original Data")
print(a)
print()

# this works as no intermediate object is created
a["Percent"] = a["Points"] / 50. * 100.

print("Changed Data")
print(a)

Original Data
      Points  StudentID  Percent
Name
Max       47      12345     90.0
Doro      48      12360     96.0
Carl      42      12349     80.0

Changed Data
      Points  StudentID  Percent
Name
Max       47      12345     94.0
Doro      48      12360     96.0
Carl      42      12349     84.0

In [57]:
# manipulation with chained indexing does not (always) work and python throws a warning
a["Percent"][a["Points"] < 47] += 2
print(a)

      Points  StudentID  Percent
Name
Max       47      12345     94.0
Doro      48      12360     96.0
Carl      42      12349     86.0

C:\Users\ritak\AppData\Local\Temp\ipykernel_12784\1108015763.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  a["Percent"][a["Points"] < 47] += 2

### Reading and writing files

The Pandas function for writing a DataFrame to ascii is called **to_csv**, with options as listed in the [documentation](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.to_csv.html).

The following selection of options is often useful:
- _sep_ or _delimiter_ : Specify the data seperator, e.g. sep=","
- _na_rep_ : Specify the string that represents NaN values, default is "" (blank)
- _mode_ : Writing mode, default is "w" for writing (select "a" for appending file)

In [58]:
# Write the DataFrame from the example above to a file:
fname = "test.csv"
print("Writing file", fname)

a.to_csv(fname)

Writing file test.csv

In [59]:
# Check the file content by native Python:
print(f"Content of file {fname}:\n")

with open(fname, "r") as f:
    print(f.read())

Content of file test.csv:

Name,Points,StudentID,Percent
Max,47,12345,94.0
Doro,48,12360,96.0
Carl,42,12349,86.0

The Pandas function for reading an ASCII file into a DataFrame is called **`read_csv()`**. As listed in the [documentation](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_csv.html) there are many options for specializing the command for your file structure.

The following selection of options is often useful:
- `sep` or `delimiter` : Specify the data seperator, e.g. `sep=","`
- `index_col` : The integer number of the column that should be the index
- `skiprows` : The number of rows to skip at the beginning of the file

In [60]:
# Read the above file:
print("Reading file", fname,"\n")
a = pd.read_csv(fname, index_col = 0,delimiter=',',decimal='.')

print(a)

Reading file test.csv

      Points  StudentID  Percent
Name
Max       47      12345     94.0
Doro      48      12360     96.0
Carl      42      12349     86.0

### 3.3.4 Handling NaN data

For Pandas, not-a-number values `np.nan` and Python's None can be equivalently used for defining non-a-number data. Note that missing data is automatically up-casted to float, since `np.nan` requires this (actually Pandas >=1.0 (Jan 2020) has experimental support for nullable booleans).

In [61]:
a = pd.DataFrame([
    [1,np.nan, 2],
    [2, 3, 5],
    [np.nan, 4, 6]])
print(a)

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [62]:
print(a.dtypes)

0    float64
1    float64
2      int64
dtype: object

We can drop all rows with NaN values (dropna() returns a copy):

In [63]:
print(a.dropna())

     0    1  2
1  2.0  3.0  5

The default is row-wise (axis=0). We can also do this column-wise:

In [64]:
print(a.dropna(axis='columns'))

# The same command can be also with axis=1
print(a.dropna(axis=1))

   2
0  2
1  5
2  6
   2
0  2
1  5
2  6

By default, dropna() uses `how=any`, which means that a row or column is drooped if *any* of its values are **NaN**. However, we can also change this to `how=all`, which would drop/remove the rows or columns only if *all* the **NaN**:

In [65]:
a[3] = np.nan
print("Original Data")
print(a)
print()

print("Data without the Column that is all NaN")
print(a.dropna(axis=1, how="all"))

Original Data
     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

Data without the Column that is all NaN
     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

Witht the function `pd.isnull()` we can find the positions of NaN values:

In [66]:
print(a.isnull())

       0      1      2     3
0  False   True  False  True
1  False  False  False  True
2   True  False  False  True

In [67]:
# and also of the non-NaN values:
print(a.notnull())

       0      1     2      3
0   True  False  True  False
1   True   True  True  False
2  False   True  True  False

We can directly set NaN values:

In [68]:
print("Original Data")
print(a)
print()

print("Changed Data")
print(a.fillna(0))

Original Data
     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

Changed Data
     0    1  2    3
0  1.0  0.0  2  0.0
1  2.0  3.0  5  0.0
2  0.0  4.0  6  0.0

We can define rules how to fill/replace NaN values:

In [69]:
print("Original Data")
print(a)
print()

# Fill with following value
print("NaNs Filled with following")
print(a.bfill())
print()

# Fill with preceding value
print("NaNs Filled with preceding")
print(a.ffill())

Original Data
     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

NaNs Filled with following
     0    1  2   3
0  1.0  3.0  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

NaNs Filled with preceding
     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  2.0  4.0  6 NaN

### Grouping

Grouping means the creation of subsets of a DataFrame, based on the values of selected columns. The data of such subsets can then be handled very efficiently for each of the group's instances (i.e. values).

The following example stems directly from the [this part](https://pandas.pydata.org/pandas-docs/stable/user_guide/groupby.html) of the [documentation](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.groupby.html):

In [70]:
animals = pd.DataFrame([('bird', 'Falconiformes', 389.0),
                       ('bird', 'Psittaciformes', 24.0),
                       ('mammal', 'Carnivora', 80.2),
                       ('mammal', 'Primates', np.nan),
                       ('mammal', 'Carnivora', 58)],
                      index=['falcon', 'parrot', 'lion', 'monkey', 'leopard'],
                      columns=('class', 'order', 'max_speed'))
print(animals)

          class           order  max_speed
falcon     bird   Falconiformes      389.0
parrot     bird  Psittaciformes       24.0
lion     mammal       Carnivora       80.2
monkey   mammal        Primates        NaN
leopard  mammal       Carnivora       58.0

In [71]:
# We can now group the data by column "class":
grouped = animals.groupby("class")
print(grouped)
print(animals[animals['class'] == 'bird'])

print(grouped.groups)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001E60B543C10>
       class           order  max_speed
falcon  bird   Falconiformes      389.0
parrot  bird  Psittaciformes       24.0
{'bird': ['falcon', 'parrot'], 'mammal': ['lion', 'monkey', 'leopard']}

In [72]:
# We can now get overall info for each group, by a summary operation on a DataFrame:
print(grouped["max_speed"].max())

class
bird      389.0
mammal     80.2
Name: max_speed, dtype: float64

In [73]:
# This also works for multiple grouping criteria:
print(animals.groupby(["class", "order"]).max())

                       max_speed
class  order
bird   Falconiformes       389.0
       Psittaciformes       24.0
mammal Carnivora            80.2
       Primates              NaN

 We can run operations on selected groups.

In [74]:
# These are DataFrames, so 

grouped = animals.groupby("class")

birds = grouped.get_group("bird")
print(birds)
print()

mammals = grouped.get_group("mammal")
print(mammals)
print()

       class           order  max_speed
falcon  bird   Falconiformes      389.0
parrot  bird  Psittaciformes       24.0

          class      order  max_speed
lion     mammal  Carnivora       80.2
monkey   mammal   Primates        NaN
leopard  mammal  Carnivora       58.0

### Datetime handling

Pandas comes with an extensive datetime functionality, as described in the [documentation](https://pandas.pydata.org/pandas-docs/stable/user_guide/timeseries.html).

In [75]:
# You can easily create a range of datetime data:
t = pd.date_range(start='2020-01-01', end='2020-01-01 06:00', freq='h')
print(t)

DatetimeIndex(['2020-01-01 00:00:00', '2020-01-01 01:00:00',
               '2020-01-01 02:00:00', '2020-01-01 03:00:00',
               '2020-01-01 04:00:00', '2020-01-01 05:00:00',
               '2020-01-01 06:00:00'],
              dtype='datetime64[ns]', freq='H')

An example for the extra functionality are day names and buisness days:

In [76]:
friday = pd.Timestamp('2024-01-19')
print(friday.day_name())
print()

# Add 1 day
saturday = friday + pd.Timedelta('1 day')
print(saturday.day_name())
print()

# Add 1 business day (Friday --> Monday)
monday = friday + pd.offsets.BDay()
print(monday.day_name())

Friday

Saturday

Monday

You can also easily create periods:

In [77]:
# Add 80 periods hourly starting from 2018-04-09 00:00:00
t = pd.date_range('2018-04-09', periods=80, freq='h')
a = pd.DataFrame(index=t)
a['A'] = np.random.randint(0,10,len(a.index))
a['B'] = np.random.randint(0,10,len(a.index))
print(a)

                     A  B
2018-04-09 00:00:00  7  9
2018-04-09 01:00:00  0  0
2018-04-09 02:00:00  5  0
2018-04-09 03:00:00  8  1
2018-04-09 04:00:00  4  2
...                 .. ..
2018-04-12 03:00:00  5  7
2018-04-12 04:00:00  3  6
2018-04-12 05:00:00  1  2
2018-04-12 06:00:00  2  3
2018-04-12 07:00:00  0  5

[80 rows x 2 columns]

In this case we created a Dataframe with a datetime index. That format is the most fun in Pandas as it provides the most implemented functions. Of a file has a column with a datatime format Pandas can automatically interprete it in most cases with the parse_dates argument

In [78]:
# Saving the last example as a .csv file
a.to_csv('test_t.csv')

# Reading this file, while interpreting the datatime format for the index
a = pd.read_csv('test_t.csv',index_col=0, parse_dates=[0])

# Print index
print(a.index)

DatetimeIndex(['2018-04-09 00:00:00', '2018-04-09 01:00:00',
               '2018-04-09 02:00:00', '2018-04-09 03:00:00',
               '2018-04-09 04:00:00', '2018-04-09 05:00:00',
               '2018-04-09 06:00:00', '2018-04-09 07:00:00',
               '2018-04-09 08:00:00', '2018-04-09 09:00:00',
               '2018-04-09 10:00:00', '2018-04-09 11:00:00',
               '2018-04-09 12:00:00', '2018-04-09 13:00:00',
               '2018-04-09 14:00:00', '2018-04-09 15:00:00',
               '2018-04-09 16:00:00', '2018-04-09 17:00:00',
               '2018-04-09 18:00:00', '2018-04-09 19:00:00',
               '2018-04-09 20:00:00', '2018-04-09 21:00:00',
               '2018-04-09 22:00:00', '2018-04-09 23:00:00',
               '2018-04-10 00:00:00', '2018-04-10 01:00:00',
               '2018-04-10 02:00:00', '2018-04-10 03:00:00',
               '2018-04-10 04:00:00', '2018-04-10 05:00:00',
               '2018-04-10 06:00:00', '2018-04-10 07:00:00',
               '2018-04-10 08:00:00', '2018-04-10 09:00:00',
               '2018-04-10 10:00:00', '2018-04-10 11:00:00',
               '2018-04-10 12:00:00', '2018-04-10 13:00:00',
               '2018-04-10 14:00:00', '2018-04-10 15:00:00',
               '2018-04-10 16:00:00', '2018-04-10 17:00:00',
               '2018-04-10 18:00:00', '2018-04-10 19:00:00',
               '2018-04-10 20:00:00', '2018-04-10 21:00:00',
               '2018-04-10 22:00:00', '2018-04-10 23:00:00',
               '2018-04-11 00:00:00', '2018-04-11 01:00:00',
               '2018-04-11 02:00:00', '2018-04-11 03:00:00',
               '2018-04-11 04:00:00', '2018-04-11 05:00:00',
               '2018-04-11 06:00:00', '2018-04-11 07:00:00',
               '2018-04-11 08:00:00', '2018-04-11 09:00:00',
               '2018-04-11 10:00:00', '2018-04-11 11:00:00',
               '2018-04-11 12:00:00', '2018-04-11 13:00:00',
               '2018-04-11 14:00:00', '2018-04-11 15:00:00',
               '2018-04-11 16:00:00', '2018-04-11 17:00:00',
               '2018-04-11 18:00:00', '2018-04-11 19:00:00',
               '2018-04-11 20:00:00', '2018-04-11 21:00:00',
               '2018-04-11 22:00:00', '2018-04-11 23:00:00',
               '2018-04-12 00:00:00', '2018-04-12 01:00:00',
               '2018-04-12 02:00:00', '2018-04-12 03:00:00',
               '2018-04-12 04:00:00', '2018-04-12 05:00:00',
               '2018-04-12 06:00:00', '2018-04-12 07:00:00'],
              dtype='datetime64[ns]', freq=None)

Now we can easily find the mean of the days, for example:

In [79]:
# Show the instances when the time was 12:00
print(a.at_time('12:00'))

                     A  B
2018-04-09 12:00:00  2  5
2018-04-10 12:00:00  1  1
2018-04-11 12:00:00  7  1

This can be used for easy average calculation:

In [80]:
# Find the mean at 12:00
print(a.at_time('12:00').mean())

A    3.333333
B    2.333333
dtype: float64

We can use the `pd.resample()` function for smart statistical calculations in the time domain

In [81]:
# for example calculate the mean of each day
a.resample('D').mean()

                   A         B
2018-04-09  4.541667  3.916667
2018-04-10  3.750000  4.666667
2018-04-11  5.041667  3.750000
2018-04-12  3.250000  4.625000

In [82]:
# or the max every 6 hours
a.resample('6h').mean()

                            A         B
2018-04-09 00:00:00  4.833333  2.500000
2018-04-09 06:00:00  7.333333  4.500000
2018-04-09 12:00:00  2.833333  3.666667
2018-04-09 18:00:00  3.166667  5.000000
2018-04-10 00:00:00  4.666667  5.166667
2018-04-10 06:00:00  4.833333  5.333333
2018-04-10 12:00:00  1.833333  3.000000
2018-04-10 18:00:00  3.666667  5.166667
2018-04-11 00:00:00  4.666667  4.666667
2018-04-11 06:00:00  5.000000  4.000000
2018-04-11 12:00:00  4.166667  3.500000
2018-04-11 18:00:00  6.333333  2.833333
2018-04-12 00:00:00  4.000000  4.833333
2018-04-12 06:00:00  1.000000  4.000000

e can also go to higher frequencies, e.g. add a value at every half hour which is the average of the full hour values before and after (with `pd.ffill` or `pd.bfill`)

In [83]:
a.resample('30min').ffill()

                     A  B
2018-04-09 00:00:00  7  9
2018-04-09 00:30:00  7  9
2018-04-09 01:00:00  0  0
2018-04-09 01:30:00  0  0
2018-04-09 02:00:00  5  0
...                 .. ..
2018-04-12 05:00:00  1  2
2018-04-12 05:30:00  1  2
2018-04-12 06:00:00  2  3
2018-04-12 06:30:00  2  3
2018-04-12 07:00:00  0  5

[159 rows x 2 columns]

### Pandas for Data Handling

**What is Data Handling?**

- The processes involved in collecting, cleaning, transforming, and analyzing data.
- It is the foundation of any data science, machine learning, or analytics task. Data can come in various forms like CSV files, databases, or APIs, and we need efficient methods to manage it.

**Importance of Data Handling**

- Efficient data handling is crucial because the quality of your data influences the quality of your insights or predictions. 
- Properly handled data can lead to more accurate results, whereas poorly managed data might produce misleading outcomes.

**Python Libraries for Data Handling**

The three most widely used libraries for data handling are:

- `numpy`: A fundamental package for numerical computing.
- `pandas`: A data analysis library offering DataFrames and Series for efficient data manipulation.
- `matplotlib`: A plotting library useful for visualizing data.

All the commands learned so far for DataFrames will be useful for analyzing and manipulating data. In the following more advanced functions and features of pandas will be explored which are commonly used for data handling.

For this purpose an artificially created dataset, called `sales_data.csv`, will be used. This dataset has 1,000 rows, with each row representing a unique sales transaction, including sales, costs, and customer and employee identifiers for different cities and product types. Some data intentionally missing to reflect common real-world scenarios. This setup allows for different types of analysis, such as sales trends, profitability and the impact of missing data on the accuracy of the analysis.

`sales_data.csv` contains the following columns:

- Date: Date of the sale.
- City: The city where the sale was made.
- Product: The product sold.
- Sales: Sales amount in dollars.
- Cost: Cost price of the product.
- Customer_ID: Unique ID of the customer.
- Employee_ID: ID of the employee who made the sale.

Lets start with data handling by importting the data:

In [85]:
# Import data from a CSV file
sales_data = pd.read_csv('data/sales_data.csv')

Brief and basic information about a dataset can be printed out using the `info()` function of Pandas DataFrames

In [86]:
# Display basic information about the dataset
sales_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Date         1000 non-null   object
 1   City         1000 non-null   object
 2   Product      1000 non-null   object
 3   Sales        951 non-null    float64
 4   Cost         971 non-null    float64
 5   Customer_ID  980 non-null    float64
 6   Employee_ID  1000 non-null   int64
dtypes: float64(3), int64(1), object(3)
memory usage: 54.8+ KB

#### Retrieve specific parts of the DataFrame

It is possible to access and view your DataFrame in a number of ways. This section introduces some of the methods used to retrieve certain parts of the data.

##### Access a column from the DataFrame

You can access the data contained in a column of the DataFrame and manipulate it individually or assign it to another variable. When you do this, you return it directly as a Pandas Series (a one-dimensional labelled array).

In [87]:
# Accessing a DataFrame column (as a Series)
sales_series = sales_data['Sales']
sales_series.head()

0    114.56
1    516.23
2    169.77
3    305.25
4    743.84
Name: Sales, dtype: float64

In [88]:
# Accessing multiple columns (as a DataFrame)
subset = sales_data[['Product', 'Sales']]
subset.head()

      Product   Sales
0      Camera  114.56
1  Smartphone  516.23
2  Smartphone  169.77
3  Headphones  305.25
4      Camera  743.84

##### Access a row by its index position

One of the first steps when working with new data is to gain a clear understanding of the available data, enabling more effective analysis. This can be achieved by looking at the content of certain parts of the data.

Unlike columns, rows do not have a 'name' by which you can refer to them. Therefore, to access rows you refer to them by their index:

In [89]:
# Accessing a row by its index position
first_row = sales_data.iloc[0]
first_row

Date           2021-04-13
City             New York
Product            Camera
Sales              114.56
Cost                59.57
Customer_ID        1507.0
Employee_ID            27
Name: 0, dtype: object

##### Retrieve rows and columns based on specific requirement 

Often time you are looking for data that fulfill certain conditions. With Pandas you can select specific rows and columns, filter based on **conditions**, and **slice** data by index positions. These operations provide a clearer understanding of the dataset, enabling more focused and efficient analysis.

In [90]:
# Slice specific rows and columns
subset = sales_data.loc[2:6, ['Product', 'Sales', 'Employee_ID']]
print("Rows 2 to 6 of the DataFrame are printed, showing values for the specified columns")
subset

Rows 2 to 6 of the DataFrame are printed, showing values for the specified columns

      Product    Sales  Employee_ID
2  Smartphone   169.77           16
3  Headphones   305.25           44
4      Camera   743.84           40
5      Camera  1624.91           26
6  Smartphone  1186.89           16

In [91]:
# Access rows 5 to 14 and columns 2 to 4 (starting from 0)
slice_data = sales_data.iloc[5:15, 2:5]
slice_data

       Product    Sales     Cost
5       Camera  1624.91  1023.76
6   Smartphone  1186.89   948.51
7       Laptop  1074.07   717.18
8   Headphones   657.63   392.18
9       Camera  1870.33  1058.67
10  Smartphone   854.33   517.00
11      Camera   265.48   162.41
12  Headphones  1272.43   662.45
13  Headphones   316.29   193.21
14      Tablet   755.92   483.24

In [92]:
# Filter data where Sales > 500 and City is 'New York'
filtered_data = sales_data[(sales_data['Sales'] > 500) & (sales_data['City'] == 'New York')]
filtered_data

,Date,City,Product,Sales,Cost,Customer_ID,Employee_ID
1,2022-03-12,New York,Smartphone,516.23,358.52,2436.0,21
5,2022-12-02,New York,Camera,1624.91,1023.76,4834.0,26
12,2022-04-04,New York,Headphones,1272.43,662.45,NaN,17
17,2021-05-11,New York,Tablet,1037.74,739.52,3589.0,44
21,2022-05-07,New York,Tablet,621.99,401.31,2089.0,45
...,...,...,...,...,...,...,...
980,2021-03-31,New York,Camera,1660.64,1120.14,2133.0,48
987,2022-11-04,New York,Laptop,1724.45,970.26,2505.0,39
988,2022-11-21,New York,Laptop,1776.86,919.65,4874.0,24
989,2021-01-10,New York,Camera,985.99,656.38,4185.0,17
998,2021-11-15,New York,Camera,1129.35,872.32,1178.0,19

In [93]:
# Filter data for specific cities (New York and Chicago)
city_filtered_data = sales_data[sales_data['City'].isin(['New York', 'Chicago'])]
city_filtered_data

,Date,City,Product,Sales,Cost,Customer_ID,Employee_ID
0,2021-04-13,New York,Camera,114.56,59.57,1507.0,27
1,2022-03-12,New York,Smartphone,516.23,358.52,2436.0,21
2,2021-09-28,New York,Smartphone,169.77,88.66,3575.0,16
3,2021-04-17,Chicago,Headphones,305.25,187.01,4426.0,44
4,2021-03-13,Chicago,Camera,743.84,551.29,1558.0,40
...,...,...,...,...,...,...,...
991,2022-10-12,Chicago,Laptop,836.87,637.34,3944.0,19
994,2021-06-17,Chicago,Camera,486.60,360.52,4548.0,10
995,2022-10-04,Chicago,Headphones,227.25,150.46,3757.0,9
998,2021-11-15,New York,Camera,1129.35,872.32,1178.0,19
999,2022-09-05,Chicago,Laptop,1939.33,1200.24,1896.0,21

#### Modifying an existing Dataset

The goal is to enhance the dataset by adding new columns derived from calculations, modifying existing columns for additional insights, and improving the organisation of the data by setting a meaningful index. These operations enable better analysis and facilitate more intuitive exploration of the data.

As we have seen in previous, adding columns with calculations in Pandas is straightforward.

In [94]:
# Display the first few rows of the DataFrame
sales_data.head()

         Date      City     Product   Sales    Cost  Customer_ID  Employee_ID
0  2021-04-13  New York      Camera  114.56   59.57       1507.0           27
1  2022-03-12  New York  Smartphone  516.23  358.52       2436.0           21
2  2021-09-28  New York  Smartphone  169.77   88.66       3575.0           16
3  2021-04-17   Chicago  Headphones  305.25  187.01       4426.0           44
4  2021-03-13   Chicago      Camera  743.84  551.29       1558.0           40

In [95]:
# Adding a new column: 'Profit'
sales_data['Profit'] = sales_data['Sales'] - sales_data['Cost']

# Applying a 10% discount on Sales
sales_data['Discounted_Sales'] = sales_data['Sales'] * 0.9
sales_data.head()

,Date,City,Product,Sales,Cost,Customer_ID,Employee_ID,Profit,Discounted_Sales
0,2021-04-13,New York,Camera,114.56,59.57,1507.0,27,54.99,103.104
1,2022-03-12,New York,Smartphone,516.23,358.52,2436.0,21,157.71,464.607
2,2021-09-28,New York,Smartphone,169.77,88.66,3575.0,16,81.11,152.793
3,2021-04-17,Chicago,Headphones,305.25,187.01,4426.0,44,118.24,274.725
4,2021-03-13,Chicago,Camera,743.84,551.29,1558.0,40,192.55,669.456

Data can also be modified within columns.

In [96]:
# Modifying an existing column: setting Employee ID to int data format
print(sales_data.dtypes)
sales_data['Employee_ID'] = sales_data['Employee_ID'].astype('int32')
sales_data.dtypes

Date                 object
City                 object
Product              object
Sales               float64
Cost                float64
Customer_ID         float64
Employee_ID           int64
Profit              float64
Discounted_Sales    float64
dtype: object

Date                 object
City                 object
Product              object
Sales               float64
Cost                float64
Customer_ID         float64
Employee_ID           int32
Profit              float64
Discounted_Sales    float64
dtype: object

Changing the index of the DataFrame is usually a routine procedure when working with time series data.

In [97]:
# Changing the index to the Date column
sales_data.set_index('Date', inplace=True)
# Print first few rows to observe changes
sales_data.head()

,City,Product,Sales,Cost,Customer_ID,Employee_ID,Profit,Discounted_Sales
Date,,,,,,,,
2021-04-13,New York,Camera,114.56,59.57,1507.0,27,54.99,103.104
2022-03-12,New York,Smartphone,516.23,358.52,2436.0,21,157.71,464.607
2021-09-28,New York,Smartphone,169.77,88.66,3575.0,16,81.11,152.793
2021-04-17,Chicago,Headphones,305.25,187.01,4426.0,44,118.24,274.725
2021-03-13,Chicago,Camera,743.84,551.29,1558.0,40,192.55,669.456

####  Handling missing values

Most datasets have missing values, so you will encounter them when working with the data. A typical approach to dealing with them is as follows:
1. Check for missing values
2. Fill missing values 
3. Drop the missing values from the data (only in special cases)

Which was also utilized in the Datetime Handling section.

The first step is to check for missing data in the dataset. This is done in a similar way to dealing with NaN values:

In [98]:
# Check for number of missing values for each column of dataset
sales_data.isnull().sum()

City                 0
Product              0
Sales               49
Cost                29
Customer_ID         20
Employee_ID          0
Profit              76
Discounted_Sales    49
dtype: int64

Missing data points are often filled in for consistency. They may be filled with a certain number, which could be the mean of that data.

In [99]:
# Fill missing Customer_ID values with the mean or max
sales_data['Cost'] = sales_data['Cost'].fillna(sales_data['Cost'].mean())
sales_data.head()

,City,Product,Sales,Cost,Customer_ID,Employee_ID,Profit,Discounted_Sales
Date,,,,,,,,
2021-04-13,New York,Camera,114.56,59.57,1507.0,27,54.99,103.104
2022-03-12,New York,Smartphone,516.23,358.52,2436.0,21,157.71,464.607
2021-09-28,New York,Smartphone,169.77,88.66,3575.0,16,81.11,152.793
2021-04-17,Chicago,Headphones,305.25,187.01,4426.0,44,118.24,274.725
2021-03-13,Chicago,Camera,743.84,551.29,1558.0,40,192.55,669.456

To make the data more accurate, more advanced methods can be used to fill in missing values. Interpolation is one such method. In the following, the 'Sales' data is linearly interpolated.

In [100]:
# Fill missing values using linear interpolation
sales_data['Sales'] = sales_data['Sales'].interpolate(method='linear')

# Check if the missing values have been removed
sales_data.isnull().sum()

City                 0
Product              0
Sales                0
Cost                 0
Customer_ID         20
Employee_ID          0
Profit              76
Discounted_Sales    49
dtype: int64

When a more simple solution is acceptable, the missing values are often filled by the previous or following data point. This is done with the `ffill` method which stands for forward fill or `bfill` which stands for backward fill, respectively.

In [ ]:
sales_data['Profit'] = sales_data['Profit'].ffill()  # Forward fill
#sales_data.bfill() # Backward fill

# Check if the missing values have been removed
sales_data.isnull().sum()

City                 0
Product              0
Sales                0
Cost                 0
Customer_ID         20
Employee_ID          0
Profit               0
Discounted_Sales    49
dtype: int64

<div style="padding: 10px; border-left: 6px solid #2196F3; border-radius: 4px;">
  <strong>Note:</strong> Removing the data with missing values, is not a recomanded method in general. However there is the possibility to do this in pandas. You should drop rows only if certain critical columns have missing values.
</div>

In [102]:
sales_data.dropna(subset=['Sales', 'Customer_ID'], inplace=True)

# Check for missing values
sales_data.isnull().sum()

City                 0
Product              0
Sales                0
Cost                 0
Customer_ID          0
Employee_ID          0
Profit               0
Discounted_Sales    49
dtype: int64

#### Performing Advanced Key Operations for Data Analysis

Performing key operations on dataset for data analysis to extract insights from data efficiently. In the following a number of typical operations will be performed in our `sales_data.csv`.

##### Group By 

Group the dataset by Product and calculate the total Sales and the mean Cost for each product. This helps in understanding the total revenue and average cost of products sold. The result is a new DataFrame that shows the total sales and average cost for each product.

In [103]:
# Group by Product and calculate total Sales and mean Cost
grouped_data = sales_data.groupby('Product').agg({'Sales': 'sum', 'Cost': 'mean'})
print(grouped_data)

                    Sales        Cost
Product
Camera      192219.056667  616.447455
Headphones  233641.830000  672.970091
Laptop      206096.415000  708.476923
Smartphone  186557.015000  647.629665
Tablet      203757.298333  726.843573

##### Pivot Tables

Create a pivot table to visualize total sales by Product and City, which will help analyze how each product performs in different cities.

In [104]:
# Create a pivot table showing total sales per Product and City
pivot_table = sales_data.pivot_table(values='Sales', index='Product', columns='City', aggfunc='sum', observed=True)
pivot_table

City             Chicago       Houston  Los Angeles   New York    Phoenix
Product
Camera      35845.145000  24259.576667    39015.690  51100.105  41998.540
Headphones  56784.600000  44246.390000    54261.250  40009.720  38339.870
Laptop      36778.750000  46739.840000    36015.060  36597.110  49965.655
Smartphone  40565.020000  30408.370000    31986.300  45686.720  37910.605
Tablet      31759.193333  40666.520000    45773.405  42057.975  43500.205

##### Time Series Analysis

Perform advanced time series analysis. This is especially useful for forecasting, trend analysis, and anomaly detection.

In [105]:
# Convert the index to datetime type
sales_data.index = pd.to_datetime(sales_data.index)

# Set 'Date' as the index
#sales_data.set_index('Date', inplace=True)

# Verify the updated dataframe
sales_data.head()

,City,Product,Sales,Cost,Customer_ID,Employee_ID,Profit,Discounted_Sales
Date,,,,,,,,
2021-04-13,New York,Camera,114.56,59.57,1507.0,27,54.99,103.104
2022-03-12,New York,Smartphone,516.23,358.52,2436.0,21,157.71,464.607
2021-09-28,New York,Smartphone,169.77,88.66,3575.0,16,81.11,152.793
2021-04-17,Chicago,Headphones,305.25,187.01,4426.0,44,118.24,274.725
2021-03-13,Chicago,Camera,743.84,551.29,1558.0,40,192.55,669.456

In [107]:
# Resample data by month and calculate total sales
monthly_sales = sales_data.resample('M').agg({'Sales': 'sum'})
monthly_sales

                   Sales
Date
2021-01-31  49619.205000
2021-02-28  46180.900000
2021-03-31  36059.140000
2021-04-30  49332.730000
2021-05-31  46745.495000
2021-06-30  39023.345000
2021-07-31  39271.870000
2021-08-31  60394.135000
2021-09-30  39100.005000
2021-10-31  31631.105000
2021-11-30  32091.130000
2021-12-31  40737.820000
2022-01-31  48850.105000
2022-02-28  40046.430000
2022-03-31  34498.893333
2022-04-30  46130.626667
2022-05-31  51071.845000
2022-06-30  32524.680000
2022-07-31  44395.945000
2022-08-31  27125.110000
2022-09-30  42740.430000
2022-10-31  51099.725000
2022-11-30  51559.875000
2022-12-31  42041.070000

##### Advanced Aggregation Techniques

You can aggregate and analyze data in more sophisticated ways.

In [108]:
# Group by Product and calculate multiple aggregation metrics
product_summary = sales_data.groupby('Product').agg({
    'Sales': ['sum', 'mean', 'std'],  # Sum, mean, and standard deviation
    'Cost': ['mean', 'min', 'max']   # Mean, min, and max of cost
})
product_summary

                    Sales                                 Cost
                      sum         mean         std        mean    min      max
Product
Camera      192219.056667   951.579488  539.006168  616.447455  56.71  1549.54
Headphones  233641.830000  1038.408133  541.679539  672.970091  69.22  1537.03
Laptop      206096.415000  1102.119866  545.518307  708.476923  59.79  1547.74
Smartphone  186557.015000  1002.994704  537.076244  647.629665  60.37  1529.92
Tablet      203757.298333  1131.984991  526.399169  726.843573  76.63  1580.53

##### Correlation and Covariance Analysis 

Understanding relationships between different variables is key in data analysis.

**Correlation** gives you an understanding of the strength and direction of the relationships between variables. The strong positive correlation between Sales and Cost, and between Sales and Profit, indicates that higher sales will likely lead to higher costs and profits.

In [109]:
# Calculate correlation matrix for numerical columns
correlation_matrix = sales_data[['Sales', 'Cost', 'Profit']].corr()
print('Correlation Matrix')
correlation_matrix

Correlation Matrix

           Sales      Cost    Profit
Sales   1.000000  0.916195  0.852663
Cost    0.916195  1.000000  0.671035
Profit  0.852663  0.671035  1.000000

**Covariance** gives you an idea of the magnitude of how variables move together. The positive covariances here support the same idea: when Sales increases, both Cost and Profit generally increase as well.

In [110]:
# Calculate covariance
covariance_matrix = sales_data[['Sales', 'Cost', 'Profit']].cov()
print('Covariance Matrix')
covariance_matrix

Covariance Matrix

                Sales           Cost         Profit
Sales   292652.048786  180527.910455  102219.203508
Cost    180527.910455  132666.467633   54163.289113
Profit  102219.203508   54163.289113   49108.667440

#### Dealing with Duplicate Entries

**What Are Duplicates?**

Duplicate entries refer to rows that contain identical or near-identical values across all or specific columns of a dataset. Duplicates can distort data aggregation, analysis, and model performance. The occurrence of duplicates is often due to:

- Data entry errors (e.g., manual entry errors).
- Multiple data sources (e.g., combining datasets without proper checks).
- Merging or joining datasets that lead to unintended row repetitions.

**Why Handling Duplicates is Critical?**

- Duplicates can skew aggregate statistics (e.g., total sales, average cost).
- Impact on machine learning models, particularly if the model trains on repeated entries of the same observation.
- In some cases, duplicates are intentional (e.g., repeat transactions from the same customer), and removing them might lead to inaccurate insights.

##### Identifying Duplicate Entries

We will first detect exact duplicates across all columns in the dataset. This is useful if an entire transaction has been recorded more than once. This will show us rows that are completely identical.

In [111]:
# Load the dataset
df = pd.read_csv('data/sales_data_with_duplicates.csv')

# Identify exact duplicates (entire row is identical)
duplicates = df[df.duplicated()]
print(f"Exact duplicate entries:")
duplicates

Exact duplicate entries:

,Date,City,Product,Sales,Cost,Customer_ID,Employee_ID
1000,2022-08-25,Los Angeles,Headphones,1047.90,636.87,1066.0,5.0
1001,2022-05-26,Los Angeles,Headphones,1526.79,NaN,2873.0,27.0
1002,2022-06-02,Los Angeles,Smartphone,625.01,497.84,1717.0,1.0
1003,2022-07-10,Chicago,Camera,1419.73,1079.74,3125.0,23.0
1004,2022-11-23,New York,Laptop,328.39,237.01,2964.0,24.0
...,...,...,...,...,...,...,...
3025,2022-10-04,NaN,Headphones,227.25,150.46,3757.0,NaN
3026,2022-08-19,NaN,Laptop,1766.97,925.51,2956.0,NaN
3027,2021-11-17,NaN,Camera,839.87,562.51,3368.0,NaN
3028,2021-11-15,NaN,Camera,1129.35,872.32,1178.0,NaN
3029,2022-09-05,NaN,Laptop,1939.33,1200.24,1896.0,NaN

In [112]:
exact_duplicates_count = df.duplicated().sum()
print(f"Total number of exact duplicate entries: {exact_duplicates_count}")

Total number of exact duplicate entries: 1030

In real-world applications, duplicates may be defined based on certain columns. For example, multiple sales records for the same customer and product on the same date may be considered duplicates.

In [113]:
# Identify duplicates based on specific columns (e.g., Date, Customer_ID, Product)
duplicates_specific = df[df.duplicated(subset=['Date', 'Customer_ID', 'Product'])]
print(f"Duplicates based on Date, Customer_ID, and Product:")
duplicates_specific

Duplicates based on Date, Customer_ID, and Product:

,Date,City,Product,Sales,Cost,Customer_ID,Employee_ID
1000,2022-08-25,Los Angeles,Headphones,1047.90,636.87,1066.0,5.0
1001,2022-05-26,Los Angeles,Headphones,1526.79,NaN,2873.0,27.0
1002,2022-06-02,Los Angeles,Smartphone,625.01,497.84,1717.0,1.0
1003,2022-07-10,Chicago,Camera,1419.73,1079.74,3125.0,23.0
1004,2022-11-23,New York,Laptop,328.39,237.01,2964.0,24.0
...,...,...,...,...,...,...,...
3025,2022-10-04,NaN,Headphones,227.25,150.46,3757.0,NaN
3026,2022-08-19,NaN,Laptop,1766.97,925.51,2956.0,NaN
3027,2021-11-17,NaN,Camera,839.87,562.51,3368.0,NaN
3028,2021-11-15,NaN,Camera,1129.35,872.32,1178.0,NaN
3029,2022-09-05,NaN,Laptop,1939.33,1200.24,1896.0,NaN

In [114]:
# Count the number of duplicates based on specific columns (e.g., Date, Customer_ID, Product)
duplicates_count_specific = df.duplicated(subset=['Date', 'Customer_ID', 'Product']).sum()
print(f"Total number of duplicates based on Date, Customer_ID, and Product: {duplicates_count_specific}")

Total number of duplicates based on Date, Customer_ID, and Product: 2030

##### Removing Duplicates

Removing Exact Duplicates (Entire Rows)

In [115]:
# Remove all exact duplicates
df_no_duplicates = df.drop_duplicates()
print(f"Data after removing exact duplicates:")
df_no_duplicates

Data after removing exact duplicates:

,Date,City,Product,Sales,Cost,Customer_ID,Employee_ID
0,2021-04-13,New York,Camera,114.56,59.57,1507.0,27.0
1,2022-03-12,New York,Smartphone,516.23,358.52,2436.0,21.0
2,2021-09-28,New York,Smartphone,169.77,88.66,3575.0,16.0
3,2021-04-17,Chicago,Headphones,305.25,187.01,4426.0,44.0
4,2021-03-13,Chicago,Camera,743.84,551.29,1558.0,40.0
...,...,...,...,...,...,...,...
2025,2022-10-04,NaN,Headphones,227.25,150.46,3757.0,NaN
2026,2022-08-19,NaN,Laptop,1766.97,925.51,2956.0,NaN
2027,2021-11-17,NaN,Camera,839.87,562.51,3368.0,NaN
2028,2021-11-15,NaN,Camera,1129.35,872.32,1178.0,NaN
2029,2022-09-05,NaN,Laptop,1939.33,1200.24,1896.0,NaN

Removing Duplicates Based on Specific Columns

In [116]:
# Remove duplicates based on 'Date', 'Customer_ID', and 'Product', keeping the first occurrence
df_no_duplicates_specific = df.drop_duplicates(subset=['Date', 'Customer_ID', 'Product'], keep='first')
print(f"Data after removing duplicates based on selected columns:")
df_no_duplicates_specific

Data after removing duplicates based on selected columns:

,Date,City,Product,Sales,Cost,Customer_ID,Employee_ID
0,2021-04-13,New York,Camera,114.56,59.57,1507.0,27.0
1,2022-03-12,New York,Smartphone,516.23,358.52,2436.0,21.0
2,2021-09-28,New York,Smartphone,169.77,88.66,3575.0,16.0
3,2021-04-17,Chicago,Headphones,305.25,187.01,4426.0,44.0
4,2021-03-13,Chicago,Camera,743.84,551.29,1558.0,40.0
...,...,...,...,...,...,...,...
995,2022-10-04,Chicago,Headphones,227.25,150.46,3757.0,9.0
996,2022-08-19,Los Angeles,Laptop,1766.97,925.51,2956.0,27.0
997,2021-11-17,Los Angeles,Camera,839.87,562.51,3368.0,13.0
998,2021-11-15,New York,Camera,1129.35,872.32,1178.0,19.0
999,2022-09-05,Chicago,Laptop,1939.33,1200.24,1896.0,21.0

In some cases, you may want to keep duplicates based on custom logic. For instance, if the same customer buys the same product on the same day multiple times, you might want to keep the row with the highest sales amount:

In [117]:
# Sort by Sales and keep the row with the highest sales for each Customer_ID and Product
df_custom_dedup = df.sort_values('Sales', ascending=False).drop_duplicates(subset=['Date', 'Customer_ID', 'Product'], keep='first')
print(f"Custom deduplicated data:\n{df_custom_dedup.head()}")

Custom deduplicated data:
            Date         City     Product    Sales     Cost  Customer_ID  \
234   2021-10-07  Los Angeles  Smartphone  1995.86  1261.23       1467.0
494   2021-06-09  Los Angeles      Tablet  1990.16  1580.53       2160.0
165   2022-07-10     New York      Camera  1988.31  1158.36       2159.0
2571  2022-07-02          NaN      Camera  1987.18  1549.54       4579.0
1049  2021-11-05          NaN      Camera  1986.35  1122.88       2301.0

      Employee_ID
234           7.0
494          26.0
165          45.0
2571          NaN
1049          NaN

In [118]:
# Remove all exact duplicates
df_no_duplicates = df.drop_duplicates()
print(f"Data after removing exact duplicates:\n{df_no_duplicates.head()}")

Data after removing exact duplicates:
         Date      City     Product   Sales    Cost  Customer_ID  Employee_ID
0  2021-04-13  New York      Camera  114.56   59.57       1507.0         27.0
1  2022-03-12  New York  Smartphone  516.23  358.52       2436.0         21.0
2  2021-09-28  New York  Smartphone  169.77   88.66       3575.0         16.0
3  2021-04-17   Chicago  Headphones  305.25  187.01       4426.0         44.0
4  2021-03-13   Chicago      Camera  743.84  551.29       1558.0         40.0